Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: For example, R30-30 would use a 30x30 ellipse for each corner.
ja: 例えば、R30-30は、各コーナーに30x30の楕円を使用する。

source: For example, Send "+abC" would send the text "AbC", and Send "!+a" would press Alt+Shift+A.
ja: 例えば、Send "+abC"を送ると「AbC」というテキストが送られ、Send "!+a"を送るとAlt+Shift+Aを押す。

source: For example, Send "This is text!a" would send the keys "This is text" and then press Alt+A.
ja: 例えば、Send "This is text!a"は、"This is text "とキーを送り、Alt+Aを押す。

source: For example, Send "^!a" would press Ctrl+Alt+A, and Send "^{Home}" would send Ctrl+Home.
ja: 例えば、Send "^!a"を送信する場合はCtrl+Alt+Aを、Send "^{Home}"を送信する場合はCtrl+Homeを送信する。

source: For example, Send "aB" presses and releases A and then presses and releases Shift+B.
ja: 例えば、Send "aB"は、Aを押して離し、Shift+Bを押して離します。

source: For example, Send "{Click}" would click the left mouse button once at the mouse cursor's current position, and Send "{Click 100 200}" would click at coordinates 100, 200 (based on CoordMode).
ja: 例えば、Send "{Click}"はマウスカーソルの現在位置でマウスの左ボタンを1回クリックし、Send "{Click 100 200}"は座標100、200（CoordModeに基づく）でクリックします。

source: For example, Send "{Control DownTemp}" followed later by Send "a" would produce A, not Ctrl+A.
ja: 例えば、Send "{Control DownTemp}"した後にSend "a"すると、 Ctrl+Aではなく、Aが出力されます。

source: For example, Send "{Raw}Regards" sends the expected text, even though pressing R (vk52) produces some other character (such as К on the Russian layout).
ja: 例えば、Send "{Raw}Regards"は所望のテキストを送信します。R（vk52）を押すと他の文字（ロシア語レイアウトではКなど）が出てくるが、期待通りのテキストが送られる。

source: For example, SendEvent "#r" would show the Start Menu's Run dialog.
ja: 例えば、SendEvent "#r"は、スタートメニューの実行ダイアログを表示します。

source: For example, SetTimer , 0 can be used inside a timer function to mark the timer for deletion, while SetTimer , 1000 would update the current timer's Period.
ja: 例えば、SetTimer , 0をタイマー関数内で使用すると、タイマーを削除するためにマークすることができ、SetTimer , 1000は現在のタイマーの周期を更新します。

source: For example, TraySetIcon "HBITMAP:" handle.
ja: 例えば、TraySetIcon "HBITMAP: "ハンドル。

source: For example, Var //= 2 performs integer division to divide Var by 2, then stores the result back in Var.
ja: 例えば、Var //= 2は、Varを2で割る整数除算を実行し、結果をVarに戻す。

source: For example, Var*=2 produces the same result as Var:=Var*2 (though the former performs better).
ja: 例えば、Var*=2はVar:=Var*2と同じ結果になる（ただし、前者の方が性能は良い）。

source: For example, X:=[] would create a new Array each time.
ja: 例えば、X:=[]とすると、毎回新しいArrayが作成されます。

source: For example, [a, b, c] is equivalent to Array(a, b, c) (a, b and c are variables).
ja: 例えば、[a, b, c]はArray(a, b, c)と等価である（a, b, cは変数）。

source: For example, ^!c is the same as !^c.
ja: 例えば、^!cは!^cと同じです。

source: For example, ^c and {Ctrl down}c{Ctrl up} activate the standard Ctrl+C shortcut and {c} is equivalent to {vk43}.
ja: 例えば、^cと{Ctrl down}c{Ctrl up}は標準のCtrl+Cショートカットを有効にし、{c}は{vk43}と同等です。

source: For example, a & b:: causes ^a:: to always use the hook.
ja: 例えば、a & b::では、^a::は常にフックを使用するようになります。

source: For example, ahk_class Notepad represents a Notepad window.
ja: 例えば、ahk_class Notepadはメモ帳ウィンドウを表します。

source: For example, alpha := [] creates a new Array and stores a reference in alpha.
ja: 例えば、alpha := []は、新しいArrayを作成し、alphaに参照を格納します。

source: For example, n.HasBase(Number.Prototype) or n is Number is true if n is a pure Integer or Float, but not if n is a numeric string, since String does not derive from Number.
ja: 例えば、n.HasBase(Number.Prototype)またはn is Numberは、nが純粋なIntegerまたはFloatの場合は真ですが、nが数値文字列の場合は真ではありません。

source: For example, not(x) is equivalent to not (x) or (not x).
ja: 例えば、not(x)は、not (x)または(not x)と同じ意味です。

source: For example, obj.Property would call get while obj.Property := value would call set.
ja: 例えば、obj.Propertyは getを呼び、obj.Property := valueは setを呼びます。

source: For example, ref := &target followed by %ref% := 1 would assign the value 1 to target.
ja: 例えば、ref := &targetの後に%ref% := 1を続けると、targetに値1が割り当てられる。

source: For example, return ComValue(0,0) returns a variant of type VT_EMPTY, which is equivalent to returning undefined (or not returning) from a JavaScript function.
ja: 例えば、return ComValue(0,0)はVT_EMPTY型のバリアントを返し、これはJavaScriptの関数からundefinedを返す（あるいは返さない）ことと同じです。

source: For example, val := obj.Property := 42 always assigns val := 42 regardless of what the property does, unless it throws an exception or exits the thread.
ja: 例えば、val := obj.Property := 42は、例外をスローするかスレッドを終了しない限り、プロパティが何をするかに関係なく、常にval := 42を代入する。

source: For example, {Enter}.{{} would apply to Enter, . and {.
ja: 例えば、{Enter}.{{}は、Enter, . および {に適用されます。

source: For example, {Esc} and {vk1B} both produce Escape.
ja: 例えば、{Esc}と {vk1B}はどちらもEscapeを生成します。

source: For example, ~0xf0f evaluates to -0xf10 (-3856), which is binary equivalent to 0xfffffffffffff0f0.
ja: 例えば、~0xf0fは-0xf10 (-3856)と評価され、これは2進数で0xfffffffffffff0f0と等価である。

source: For example, "::btw" or ":*:]d".
ja: 例えば、"::btw"または":*:]d"です。

source: For example, "Icon2" loads the file's second icon.
ja: 例えば、"Icon2"は、ファイルの2番目のアイコンをロードします。

source: For example, "hicon:" handle, where handle is a variable containing an icon handle.
ja: 例えば、"hicon:" handleのように、handleはアイコンハンドルを含む変数である。

source: For example, (x + 1) ? y : z and x+1 ? y : z are expression statements but x + 1 ? y : z is a function call statement.
ja: 例えば、(x + 1) ? y : zやx+1 ? y : z は、式ですが、x + 1 ? y : zは、関数呼び出し文です。

source: For example, *Icon2 would load the default icon from the second icon group.
ja: 例えば、*Icon2は、2番目のアイコングループからデフォルトのアイコンをロードします。

source: For example, +MinSize +MinSize640x would use the window's current size for the height and 640 for the width.
ja: 例えば、+MinSize +MinSize640xは、高さにウィンドウの現在のサイズ、幅に640を使用します。

source: For example, 1 & 2:: will activate even if Ctrl or Alt is held down when 1 and 2 are pressed, whereas ^1:: would be activated only by Ctrl+1 and not Ctrl+Alt+1.
ja: 例えば、1 & 2::は、1と2を押したときにCtrlまたはAltが押されていても起動しますが、^1::はCtrl+1で起動し、Ctrl+Alt+1では起動しないでしょう。

source: For example, ComObjFlags(obj, -1) removes the F_OWNVALUE flag.
ja: 例えば、ComObjFlags(obj, -1)は、F_OWNVALUEフラグを削除します。

source: For example, Format("{:c}", 116) returns t.
ja: 例えば、Format("{:c}", 116)はtを返します。

source: For example, HScroll500 would allow 500 pixels of scrolling inside the ListBox.
ja: 例えば、HScroll500を指定すると、ListBox内で500ピクセルのスクロールが可能になります。

source: For example, Hotstring ":T:btw" will find ::BTW by default, but not if Hotstring "C" or #Hotstring C is in effect.
ja: 例えば、Hotstring ":T:btw"はデフォルトで::BTWを検索しますが、Hotstring "C"または#Hotstring Cが有効な場合は検索しません。

source: For example, OnMessage Msg, Fn, -2 registers Fn to be called before any other functions previously registered for Msg, and allows Fn a maximum of 2 threads.
ja: 例えば、OnMessage Msg, Fn, -2は、Msgにあらかじめ登録されている他の関数の前にFnを呼び出すように登録し、Fnには最大2スレッドを許可します。

source: For example, Send "{Control DownR}" followed later by Send "a" would produce A, not Ctrl+A, but will leave Ctrl in the pressed state for use with keyboard shortcuts.
ja: 例えば、Send "{Control DownR}"した後にSend "a"すると、Ctrl+AではなくAを生成しますが、キーボードショートカットを使用するためにCtrlを押したままの状態にします。

source: For example, Send "{Raw}``100`%" sends the string `100%.
ja: 例えば、Send "{Raw}``100`%"は、文字列`100%を送信します。

source: For example, T10.0 is ten seconds.
ja: 例えば、T10.0は10秒です。

source: For example, Var := ++X increments X and then assigns its value to Var.
ja: 例えば、Var := ++XはXをインクリメントし、その値をVarに代入する。

source: For example, b::a would produce Ctrl+A if you press Ctrl+B.
ja: 例えば、b::aは、Ctrl+Bを押すとCtrl+Aになる。

source: For example, dictionary["Count"] can return the definition of "Count" while dictionary.Count returns the number of words contained within.
ja: 例えば、dictionary["Count"]は「Count」の定義を返し、dictionary.Countは、その中に含まれる単語の数を返すことができる。

source: For example, not (x = 3 or y = 3) is the same as !(x = 3 or y = 3).
ja: 例えば、not (x = 3 or y = 3)は!(x = 3 or y = 3)と同じである。

source: For example, r30-30 would use a 30x30 ellipse for each corner.
ja: 例えば、r30-30は、各コーナーに30x30の楕円を使用する。

source: For example, sc01e::vk42sc030 is equivalent to a::b on most keyboard layouts.
ja: 例えば、sc01e::vk42sc030は、ほとんどのキーボードレイアウトではa::bと等価である。

source: For example, static x := {}, x.y := 42 declares x and also initializes ClassName.x.y.
ja: 例えば、static x := {}, x.y := 42はxを宣言し、ClassName.x.yも初期化します。

source: For example, super.Method() in the class defined above would typically call the version of Method which was defined within BaseClassName.
ja: 例えば、上で定義したクラスのsuper.Method()は、通常、BaseClassNameの中で定義されたバージョンのMethodを呼び出します。

source: For example, this.Property[x] would have the same effect as (this.Property)[x] or y := this.Property, y[x].
ja: 例えば、this.Property[x]は、(this.Property)[x]またはy := this.Property, y[x]と同じ効果を持つ。

source: For example, var := x>y ? 2 : 3 stores 2 in Var if x is greater than y; otherwise it stores 3.
ja: たとえば、var := x>y ? 2 : 3は、xがyより大きければVarに2を格納し、そうでなければ3を格納する。

source: For example, x := {}, x.y := 42 declares x and also initializes this.x.y.
ja: 例えば、x := {}, x.y := 42はxを宣言し、this.x.yも初期化する。

source: For example, x+m uses the right edge of the previous control plus the standard padding distance.
ja: 例えば、x+mは、前のコントロールの右端に標準的なパディング距離を加えたものを使用します。

source: For example, x.Show() might show a menu, show a GUI, raise an error or do something else, depending on what x is.
ja: 例えば、x.Show()は、xが何であるかによって、メニューを表示したり、GUIを表示したり、エラーを発生させたり、何か他のことをしたりします。

source: For example, {Tab} is Tab and {!} is a literal exclamation mark.
ja: 例えば、{Tab} は Tab、{!}は文字通りのエクスクラメーションマークです。

source: For example, 1.1 and (.5) are numbers, A_Args.Has(3) is a method call and A_Args.Length is a property access.
ja: 例えば、1.1と(.5)は数値、A_Args.Has(3)はメソッド呼び出し、A_Args.Lengthはプロパティアクセスである。

source: For example, Array(MyVar?) is equivalent to Array(IsSet(MyVar) ? MyVar : unset).
ja: 例えば、Array(MyVar?)はArray(IsSet(MyVar) ? MyVar : unset)と等価です。

source: For example, BlockInput "On" will continue to block input until BlockInput "Off" is used, even if one of the words from SendMouse is also in effect.
ja: 例えば、BlockInput "On"は、SendMouseからのワードの1つが有効であっても、BlockInput "Off"が使われるまで、入力をブロックし続けます。

source: For example, Format("{:
ja: 例えば、Format("{:

source: For example, Format("{: 05d}", 1) returns 0001.
ja: 例えば、Format("{: 05d}", 1)は 0001を返します。

source: For example, Format("{:#x}", 1) returns 0x1.
ja: 例えば、Format("{:#x}", 1)は0x1を返します。

source: For example, Format("{:.2f}", 1) returns 1.00.
ja: 例えば、Format("{:.2f}", 1)は1.00を返します。

source: For example, I2 would ignore any input with a level of 0 (the default) or 1, but would capture input at level 2.
ja: 例えば、I2は、レベルが0（デフォルト）または1の入力は無視し、レベル2の入力を捕捉することができます。

source: For example, InStr("abc", "bc",, 2, +1) will find a match but InStr("abc", "bc",, 2, -1) will not.
ja: 例えば、InStr("abc", "bc",, 2, +1)はマッチしますが、InStr("abc", "bc",, 2, -1)はそうではありません。

source: For example, Join`s would insert a space after each line except the last.
ja: 例えば、Join`sは最後の行を除く各行の後にスペースを挿入する。

source: For example, MyFunc(Var, Var++) would unexpectedly pass 1 and 0 when Var is initially 0, because the first Var is not dereferenced until the function call is executed.
ja: 例えば、MyFunc(Var, Var++)は、Varが最初に0である場合、予期せず1や0を渡してしまいますが、これは最初のVarが関数呼び出しが実行されるまで再参照されないからです。

source: For example, Var+=2 produces the same result as Var:=Var+2 (though the former performs better).
ja: 例えば、Var+=2はVar:=Var+2と同じ結果になる（ただし、前者の方が性能は良い）。

source: For example, if myvar := 0 assigns a new value and gives the same result every time (false), whereas if myvar = 0 compares a previously-assigned value with 0.
ja: 例えば、if myvar := 0の場合は新しい値を割り当て、毎回同じ結果（偽）を出すのに対し、if myvar = 0は、以前に割り当てられた値を0と比較します。

source: For example, match.1 or match.Year.
ja: 例えば、match.1 や match.Yearなどです。

source: For example, x := &y takes a reference to y and assigns it to x, then %x% := 1 assigns to the variable y and %x% reads its value.
ja: 例えば、x := &yは yへの参照を取り、それをxに代入する。次に、%x% := 1は変数yに代入し、%x%はその値を読み取る。

source: For example, x := y := 1 would set this.x and a local variable y (which would be freed once all initializers have been evaluated).
ja: 例えば、x := y := 1とすると、this.xとローカル変数yが設定される（初期化子がすべて評価されると解放される）。

source: For example, !A presses Alt+Shift+A and !a presses Alt+A.
ja: 例えば、!Aは Alt+Shift+A、および、!aは、Alt+Aを押します。

source: For example, "" or "default" yields "default" instead of 1.
ja: 例えば、"" or "default"は、1ではなく、「default」を出力します。

source: For example, "B`r`nA" will sort as expected, but "A`r`nA`t`r`nB" will place A`t`r before A`r.
ja: 例えば、"B`r`nA"は期待通りにソートされるが、"A`r`nA`t`r`nB"はA`t`rを A`rの前に置く。

source: For example, "this is a quoted string" and 'so is this'.
ja: 例えば、"これは引用符で囲まれた文字列です"そして'これはそうです'という具合です。

source: For example, 0x001 is valid, but 000x1 is not.
ja: 例えば、0x001は有効ですが、000x1は無効です。

source: For example, @ and 2 are both equivalent to {vk32} on the US keyboard layout.
ja: 例えば、@と 2はどちらもUSキーボードレイアウトの{vk32}と同等です。

source: For example, w200 h100.
ja: 例えば、w200 h100。

source: For example, x := {a:
ja: 例えば、x := {a:

source: For example, x := {a: b} is equivalent to x := Object(), x.a := b.
ja: 例えば、x := {a: b} はx := Object(), x.a := bと等価である。

source: For example, x0 y0 puts the window at the upper left corner of the desktop.
ja: 例えば、x0 y0はウィンドウをデスクトップの左上隅に置きます。

source: For example, {Raw}.
ja: 例えば、{Raw}です。

source: For example, "::btw" and "::BTW" match unless the case-sensitive mode was enabled as a default, while ":C:btw" and ":C:BTW" never match.
ja: 例えば、"::btw"と"::BTW"は、デフォルトで大文字小文字を区別するモードが有効になっていなければ一致しますが、":C:btw"と":C:BTW"は決して一致しません。

source: For example, 10, 1+1 and MyVar are valid expressions.
ja: 例えば、10、1+1、MyVarは有効な表現です。

source: For example, 3 + 2 * 2 is evaluated as 3 + (2 * 2).
ja: 例えば、3 + 2 * 2は、3 + (2 * 2)と評価されます。

source: For example, >=2-rc <2 allows v2 release candidates but not the final release.
ja: 例えば、>=2-rc <2はv2のリリース候補を許可するが、最終リリースは許可しない。

source: For example, Format("{:X}", 255) returns FF.
ja: 例えば、Format("{:X}", 255)はFFを返します。

source: For example, Format("{:a}", 255) returns 0x1.fe00000000000p+7.
ja: 例えば、Format("{:a}", 255)は0x1.fe00000000000p+7を返します。

source: For example, Format("{:a}", 255) returns 0x1.fe0000p+7.
ja: 例えば、Format("{:a}", 255)は0x1.fe0000p+7を返します。

source: For example, Send "{Ctrl}a" would press and release Ctrl, then press and release A; probably not what you want.
ja: 例えば、Send "{Ctrl}a"を実行すると、Ctrlを押したまま離し、Aを押したまま離すことになり、おそらく望むところではありません。

source: For example, Var := X++ increments X but Var receives the value X had before it was incremented.
ja: 例えば、Var := X++はXをインクリメントするが、VarはXがインクリメントされる前の値を受け取る。

source: For example, wp would set a control's width to that of the previous control, and wp-50 would set it equal to 50 less than that of the previous control.
ja: 例えば、wpはコントロールの幅を前のコントロールの幅に設定し、wp-50は前のコントロールの幅より50小さい幅に設定します。

source: For example, ComObj.Ptr is equivalent to ComObjValue(ComObj) in these cases.
ja: 例えば、ComObj.Ptrは、これらの場合、ComObjValue(ComObj)と同等です。

source: For example, FileSetAttrib("+a", "*.zip", "RF") (Recursively operate on Files only).
ja: 例えば、FileSetAttrib("+a", "*.zip", "RF")(Fileのみに対して再帰的に操作)。

source: For example, vk1Bsc001:: raises an error.
ja: 例えば、vk1Bsc001::はエラーになります。

source: For example, #HotIf WinActive("Chrome") or #HotIf !WinExist("Popup").
ja: 例えば、#HotIf WinActive("Chrome")や#HotIf !WinExist("Popup") のようなものです。

source: For example, Format("{:e}", 255) returns 2.550000e+002.
ja: 例えば、Format("{:e}", 255)は2.550000e+002を返します。

source: For example, Format("{:e}", 255) returns 2.550000e+02.
ja: 例えば、Format("{:e}", 255)は2.550000e+02を返します。

source: For example, Send "{Raw}{Tab}" sends {Tab} instead of Tab.
ja: 例えば、Send "{Raw}{Tab}"は、Tabの代わりに{Tab}を送信します。

source: For example, if(expression).
ja: 例えば、if(expression)。

source: For example, x[y] := z.
ja: 例えば、x[y] := z。

source: For example, GetKeyState("Shift") returns (evaluates to) 1 if Shift is being held down or 0 otherwise.
ja: 例えば、GetKeyState("Shift")は、Shiftが押されている場合は1を、それ以外の場合は0を返す（評価される）。

source: For example, IShellItem2 is an extension of IShellItem, which starts at index 3 and contains 5 methods, so IShellItem2's first method (GetPropertyStore) is at index 8.
ja: 例えば、IShellItem2は IShellItemの拡張で、インデックス3から始まり、5つのメソッドを含むので、IShellItem2の最初のメソッド（GetPropertyStore）はインデックス8にあります。

source: For example, MatchList might consist of List1 "," List2 "," List3 -- where each of the variables contains a large sub-list of match phrases.
ja: 例えば、MatchListは List1 "," List2 "," List3からなり、それぞれの変数にマッチフレーズの大きなサブリストが含まれていることがあります。

source: For example, W200 H100.
ja: 例えば、W200 H100。

source: For example, X0 Y0 puts the window at the upper left corner of the desktop.
ja: 例えば、X0 Y0とすると、デスクトップの左上にウィンドウが表示されます。

source: For example, IID can be "{7FB7B48F-531D-44A2-BCB3-5AD5A134B3DC}" to retrieve the IAudioVolumeLevel interface, which provides access to per-channel volume level controls.
ja: 例えば、IIDを "{7FB7B48F-531D-44A2-BCB3-5AD5A134B3DC}"とすると、IAudioVolumeLevelインターフェイスを取得することができる。

source: For example, Esc is not the same as Escape for this purpose (though the case does not matter).
ja: 例えば、Escはこの目的ではEscapeと同じではありません（ただし、ケースは重要ではありません）。

source: For example, Win+E normally launches File Explorer, and F1 often activates an app-specific help function.
ja: 例えば、Win+Eは、通常ファイルエクスプローラーを起動し、F1はアプリ固有のヘルプ機能を起動することが多い。

source: For example, (Sun|Mon|Tues|Wednes|Thurs|Fri|Satur)day matches the name of any day.
ja: 例えば、(Sun|Mon|Tues|Wednes|Thurs|Fri|Satur)dayは、どの日の名前にもマッチする。

source: For example, ^abc$ matches only abc (i.e. there must be no other characters before or after it).
ja: 例えば、^abc$は abcはマッチする（つまり、その前後に他の文字があってはならない）。

source: For example, (?im) turns on the case-insensitive and multiline options for the remainder of the pattern (or subpattern if it occurs inside a subpattern).
ja: 例えば、(?im)は、パターン（またはサブパターン内で発生した場合はサブパターン）の残りの部分の大文字小文字を区別しないオプションと複数行オプションをオンにします。

source: For example, [^/]* matches zero or more occurrences of any character that is not a forward-slash, such as http://.
ja: 例えば、[^/]*は、http:// のような、フォワード・スラッシュでない文字が0個以上出現した場合にマッチする。

source: For example, [abc] means "any single character that is either a, b or c".
ja: 例えば、[abc]は「a、b、cのいずれか1文字」を意味する。

source: For example, \. is a literal period and \\ is a literal backslash.
ja: 例えば、\.はリテラルピリオド、\\はリテラルバックスラッシュです。

source: For example, ^abc matches abc123 but not 123abc.
ja: 例えば、^abcは abc123にマッチするが、123abcにはマッチしない。

source: For example, abc$ matches 123abc but not abc123.
ja: 例えば、abc$は123abcにマッチするが、abc123にはマッチしない。

source: For example, gray|grey matches both gray and grey.
ja: 例えば、gray|greyは grayと greyの両方にマッチする。

source: For example, m)^abc$ matches 123`r`nabc`r`n789.
ja: 例えば、m)^abc$は123`r`nabc`r`n789にマッチする。

source: For example, foo\Kbar matches "foobar" but reports that it has matched "bar".
ja: 例えば、foo\Kbarは「foobar」にマッチするが、「bar」にマッチしたと報告する。

source: For example, \bcat\b doesn't match catfish, but it matches cat regardless of what punctuation and whitespace surrounds it.
ja: 例えば、\bcat\bは、「catfish」にマッチしないが、catは、句読点や空白に関係なくマッチする。

source: For example, a* matches ab and aaab.
ja: 例えば、a*は abとaaabにマッチする。

source: For example, colou?r matches both color and colour because the "u" is optional.
ja: 例えば、colou?rは、「u」がオプションなので、colorとcolourの両方にマッチする。

source: For example, \pL matches any letter and \p{Lu} matches any upper-case letter.
ja: 例えば、\pLは任意の文字にマッチし、\p{Lu}は任意の大文字にマッチします。

source: For example, abc.*123 matches abcAnything123 as well as abc123.
ja: 例えば、abc.*123はabcAnything123にもabc123にもマッチする。

source: For example, [0-9]+ matches one or more occurrence of any digit; thus it matches xyz123 but not abcxyz.
ja: たとえば、[0-9]+は、任意の数字が1つ以上出現した場合にマッチする。したがって、xyz123にはマッチするが、abcxyzにはマッチしない。

source: For example, ab. matches abc and abz and ab_.
ja: 例えば、ab.はabcと abzと ab_にマッチする。

source: For example, a{1,2} matches ab but only the first two a's in aaab.
ja: たとえば、a{1,2}は abにマッチするが、aaabの最初の2つのaにしかマッチしない。

source: For example, (abc)+ matches one or more occurrences of the string "abc"; thus it matches abcabc123 but not ab123 or bc123.
ja: たとえば、(abc)+は、文字列「abc」の1つ以上の出現にマッチする。したがって、abcabc123にはマッチするが、ab123やbc123にはマッチしない。

source: For example, abc(?=.*xyz) is a look-ahead assertion that requires the string xyz to exist somewhere to the right of the string abc (if it doesn't, the entire pattern is not considered a match).
ja: たとえば、abc(?=.*xyz)は、文字列xyzが文字列abcの右側のどこかに存在することを必要とするルックアヘッド・アサーションである（存在しない場合、パターン全体がマッチするとはみなされない）。

source: For example, A_LoopField returns the current substring in the innermost parsing loop, even if it is used inside a file or registry loop.
ja: 例えば、A_LoopFieldは、ファイルやレジストリのループ内で使用されていても、最も内側の解析ループの現在の部分文字列を返します。

source: For example, AutoHotkey scripts have an "edit" verb which opens the script in an editor, and (if Ahk2Exe is installed) a "compile" verb which compiles the script.
ja: 例えば、AutoHotkeyスクリプトには、スクリプトをエディタで開く「edit」動詞と、（Ahk2Exeがインストールされていれば）スクリプトをコンパイルする「compile」動詞があります。

source: For example, Internet Explorer does this when it exits.
ja: 例えば、Internet Explorerは終了時にこのような動作をします。

source: For example, Windows 7 SP1 is 6.1.7601.
ja: 例えば、Windows 7 SP1は6.1.7601です。

source: For example, \w becomes equivalent to [\p{L}\p{N}_] and \d becomes equivalent to \p{Nd}.
ja: 例えば \wは[\p{L}\p{N}_]と等価になり、\dは\p{Nd}と等価になる。

source: For example, `n indicates a linefeed character, which ends the current line and begins a new one.
ja: 例えば、`nは改行文字を示し、現在の行を終了して新しい行を開始します。

# For example, `t is the same as except when the x option is used.
source: For example, `t is the same as \t except when the x option is used.
ja: 例えば、`tはxオプションを使う場合を除き、\tと同じです。

# For example, `t is the same as .
source: For example, `t is the same as \t.
ja: 例えば、`t は \t と同じです。

source: For example, a "proxy" object could be created which sends requests for properties over the network (or through some other channel).
ja: 例えば、プロパティに対するリクエストをネットワーク経由で（あるいは他のチャネル経由で）送信する「プロキシ」オブジェクトを作成することができる。

source: For example, a 4-digit string such as 2004 is considered valid.
ja: 例えば、2004のような4桁の文字列は有効であると判断されます。

source: For example, a Close callback may return a non-zero number (such as true) to prevent the GUI window from closing.
ja: 例えば、Closeコールバックは、GUIウィンドウが閉じないように、0以外の数値（trueなど）を返すことができます。

source: For example, a File object provides methods to read data from a file or write data to a file.
ja: 例えば、Fileオブジェクトは、ファイルからデータを読み込んだり、ファイルにデータを書き込むためのメソッドを提供します。

source: For example, a Gui represents a GUI window; it provides a script with the means to create and display a graphical user interface; it contains a collection of controls, and provides information about the window via properties such as Title and FocusedCtrl.
ja: 例えば、GuiはGUIウィンドウを表し、スクリプトにGUIを作成・表示する手段を提供し、コントロールのコレクションを含み、TitleやFocusedCtrlなどのプロパティによってウィンドウに関する情報を提供します。

source: For example, a script consisting only of the following line would make A behave like B:
ja: 例えば、以下の行だけで構成されるスクリプトは、Aを Bのように動作させる：

source: For example, a WebBrowserTitle variable could be used to make your code easier to update when and if you were to change your preferred web browser, or if the title or window class changes due to a software update.
ja: 例えば、WebBrowserTitleという変数を使えば、好みのウェブブラウザを変更したり、ソフトウェアのアップデートでタイトルや ウィンドウクラスが変わったりしたときに、コードを簡単に更新することができるようにすることができます。

source: For example, a HWND of a GUI control can be retrieved via GuiControl.Hwnd, MouseGetPos or OnMessage.
ja: 例えば、GUIコントロールのHWNDは、GuiCtrl.Hwnd、MouseGetPos、OnMessageで取得することができます。

source: For example, a HWND of a GUI control can be retrieved via GuiCtrl.Hwnd, MouseGetPos or OnMessage.
ja: 例えば、GUIコントロールのHWNDは、GuiCtrl.Hwnd、MouseGetPos、OnMessageで取得することができます。

source: For example, a ListView can be restored to the default color via LV.Opt("+BackgroundDefault").
ja: 例えば、LV.Opt("+BackgroundDefault")でListViewをデフォルトの色に戻すことができる。

source: For example, a TreeView can be restored to the default color via TV.Opt("+BackgroundDefault").
ja: 例えば、TreeViewはTV.Opt("+BackgroundDefault")でデフォルトの色に戻すことができます。

source: For example, a control can be restored to the default color via LV.Opt("+BackgroundDefault").
ja: 例えば、LV.Opt("+BackgroundDefault")でコントロールをデフォルトの色に戻すことができます。
